{
    "entries": [
        {
            "image": "images/army-cyber.png",
            "link": "https://www.arcyber.army.mil/",
            "tags": [
                "Leadership",
                "Cyber Operations",
                "Electronic Warfare",
                "Information Operations",
                "Project Management"
            ],
            "title": "Army Cyber",
            "text": "After completing Army ROTC, I commissioned into the Army's Cyber branch. Serving as a Cyber officer has been an honor and a privilege, as the role provides for far reaching impacts and responsibilities. I am excited about the future of Army Cyber and my personal role in shaping it.",
            "alt": "Army Cyber"
        },
        {
            "image": "images/amazon_ads.png",
            "link": "https://advertising.amazon.com/",
            "tags": [
                "Full-time",
                "Infrastructure",
                "AWS",
                "Javascript",
                "Java",
                "Testing",
                "Git"
            ],
            "title": "Amazon Ads",
            "text": "At Amazon Ads, I work for a core infrastructure team that builds tools for advertising campaigns at Amazon. Our tools enable hasty and in-depth problem management, better analysis of the health of applications, and constant improvements to the developer experience. In my role, I have deployed several improvements to generalize an internal logging tool that monitors the health of our applications, held design reviews and implemented backend changes for optimal error handling, and worked with my team to determine a future platform for our downstream applications.",
            "alt": "Amazon Ads"
        },
        {
            "image": "images/requipper.png",
            "link": "https://www.requipper.com/",
            "tags": [
                "Contract",
                "Infrastructure",
                "GCP",
                "Python",
                "Selenium",
                "Linux",
                "RPC",
                "Git"
            ],
            "title": "Requipper",
            "text": "CEO Alex F. had a problem. He was spending way too much of his time managing shopping listings between Requipper's internal inventory and other third-party sellers. My first task was to solve this problem by any means possible. I started off automating listing updates from those third party sellers, using Selenium scripts running on a Google Cloud server. Beyond that, I helped to increase brand awareness by creating automatic listing uploads to Google Merchant Center, where we could advertise our products. Working for Alex made me constantly think on my feet for innovative and unconventional solutions.",
            "alt": "Requipper"
        },
        {
            "image": "images/mana.png",
            "link": "https://mana.ai/",
            "tags": [
                "Part-time",
                "ML",
                "Docker",
                "Python",
                "Server",
                "Linux",
                "RPC",
                "PostgreSQL",
                "Git"
            ],
            "title": "Mana.Ai",
            "text": "From the summer 2020 to fall 2021 I had the pleasure of working for Mana, a San Francisco-based company working to help people to better spend their time in their mobile app. I was hired as a machine-learning engineer, and built a pipeline that improved predictions by over 15%. Adding integration and calendar data has only made the pipeline more accurate, and I am currently working toward automatic predictions for our users 24/7. Working with this team has brought me mentorship beyond any other professional experience and encouraged me to further pursue applied machine learning and software engineering.",
            "alt": "Mana"
        },
        {
            "image": "images/whiteboard.png",
            "link": "https://www.whiteboardbeta.com/",
            "tags": [
                "Contract",
                "React Native",
                "Google Firebase",
                "Git"
            ],
            "title": "Whiteboard",
            "text": "After deploying an MVP of Whiteboard Mobile to Testflight within a 10-week DALI Lab sprint, the founders of Whiteboard reached out to me and asked me to continue refining the app. I worked on performance improvements, bug fixes, and additional functionality past the MVP, creating an app that appealed to investors.",
            "alt": "Whiteboard"
        },
        {
            "image": "images/dali-logo.png",
            "link": "http://dali.dartmouth.edu/",
            "tags": [
                "Part-time",
                "HTML",
                "CSS",
                "JS",
                "React",
                "React Native",
                "Node.js",
                "MongoDB",
                "Git"
            ],
            "title": "The DALI Lab",
            "text": "The DALI Lab is a startup-like experiential learning program at Dartmouth College. Working at the Lab was a transformative experience for me, as it's where I gained my first experiences in application development. The range of projects I worked on there include an interactive site to educate communities about email phishing, a stock market simulator with AI-generated data, and a groundbreaking app to track and identify undiagnosed illnesses. Working there gave me opportunities to work on projects that have social impacts beyond the Lab.",
            "alt": "DALI"
        },
        {
            "image": "images/dartmouth.png",
            "link": "https://web.cs.dartmouth.edu/",
            "tags": [
                "Python",
                "Java",
                "OOP",
                "Encrytion",
                "AI",
                "ML",
                "C",
                "Bash",
                "HTML",
                "CSS",
                "JS",
                "Auth"
            ],
            "title": "Dartmouth CS",
            "text": "My journey in computer science began my Freshman year at Dartmouth, when I first took CS1. Since then I've tutored nine students in that class and been a teaching assistant in another foundational course and Full-Stack Web Development. Many concepts I apply in my work as a software engineer are informed and inspired by concepts learned in Dartmouth classes and while tutoring my students.",
            "alt": "Dartmouth"
        },
        {
            "image": "images/army.png",
            "link": "https://www.army.mil/",
            "tags": [
                "Leadership",
                "Service",
                "Information Operations",
                "Targeting",
                "Inteligence Synthesis"
            ],
            "title": "US Army (Enlisted and ROTC)",
            "text": "Between finding purpose in serving my local and national community and meeting soldiers from all walks of life, my experience in the Army has been eye-opening and deeply satisfying. I served as an intelligence analyst from 2017 to 2019. I am currently serving in the Cyber Protection Brigade, having commissioned as a Cyber officer out of Dartmouth ROTC in 2022.",
            "alt": "Army"
        }
    ]
}
